//Задание: Счетчик уникальных слов(ASCII, регистр не важен)
//Условия: Все слова на английском языке, разный регистр, который нужно игнорировать)
//1. Поступает слово
//2. Приводим к одному регистру
//3. Проверка слова на наличие в списке
//   - Слова нет?  => добавляем в список
//   - Слово есть? => игнорируем
//---------------------------------------

#include <iostream>
#include <list>
int list <string> spisok = {}
int main(){
    list_spisok.push_back("kek")
    std:: cout << spisok << std:: endl;
}
//int unicword(string word){

//}
