#include<iostream> //Личный файл двойные ковычки
int main(){
    std:: cout << "hello111" << std:: endl;

return 0;
}

//int 32 bit
// int a = 5;
// double это вещественное
// for (innt i = 0; i < <i++);
// vector аналог списков
// include <string> строки
// include <vector> списки
//&& - и, || - или, 
// сигнатура: название функции, параметры, тип данных
//3 примера для первого
//5 примеров для второго
//!!!ПРАВИЛА!!!
//проверять только через терминал, пушить на гитлаб через gitbush
//



// На вход поступает 2 переменные: ширина и высота
